---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Reset
source: html/67d00d1d-40f0-f8a4-d3c1-83c2b6731a2d.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```